RT-Thread-packages/gd32-arm-cmsis/GD32H77x_78x/GD/GD32H77x_78x/Source/ARM/startup_gd32h77x_78x.s
                DCD     TIMER22_DEC_IRQHandler                       ; 229:TIMER22 DEC interrupt
                DCD     TIMER23_DEC_IRQHandler                       ; 230:TIMER23 DEC interrupt
                DCD     TIMER30_DEC_IRQHandler                       ; 231:TIMER30 DEC interrupt
                DCD     TIMER31_DEC_IRQHandler                       ; 232:TIMER31 DEC interrupt
                DCD     CPU_DCACHE_ERR_IRQHandler                    ; 233:CPU D-Cache error detection interrupt
                DCD     CPU_ICACHE_ERR_IRQHandler                    ; 234:CPU I-Cache error detection interrupt
                DCD     VOVD_VUVD_FILTER_IRQHandler                  ; 235:VOVD / VUVD interrupt after digital filtering
                DCD     0                                            ; 236:Reserved
                DCD     TIMER0_Channel_BRK_IRQHandler                ; 237:TIMER0 channel break interrupt
                DCD     TIMER7_Channel_BRK_IRQHandler                ; 238:TIMER7 channel break interrupt
                DCD     DSI_IRQHandler                               ; 239:DSI global interrupt
                DCD     PKCAU_IRQHandler                             ; 240:PKCAU global interrupt
                DCD     ESC_BRIDGE_IRQHandler                        ; 241:ESC internal interrupt
                DCD     EDIM_IRQHandler                              ; 242:EDIM global interrupt

__Vectors_End

__Vectors_Size  EQU  __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

;/* reset Handler */
Reset_Handler    PROC
                 EXPORT  Reset_Handler                    [WEAK]
                 IMPORT  SystemInit
                 IMPORT  __main
                 IMPORT |Image$$RW_IRAM1$$RW$$Base|
                     

                 LDR     R0, =|Image$$RW_IRAM1$$RW$$Base|
                 ADD     R1, R0, #0x8000
                 LDR     R2, =0x0
MEM_INIT         STRD    R2, R2, [ R0 ] , #8
                 CMP     R0, R1
                 BNE     MEM_INIT

                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

;/* dummy Exception Handlers */
NMI_Handler\
                PROC
                EXPORT  NMI_Handler                       [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler                 [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler                 [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler                  [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler                [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                       [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler                  [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler                    [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler                   [WEAK]
                B       .
                ENDP                                     
                                                          
Default_Handler PROC                                      
;               /* external interrupts handler */
                EXPORT  WWDGT_IRQHandler                  [WEAK]
                EXPORT  VAVD_LVD_VOVD_VUVD_IRQHandler     [WEAK]
                EXPORT  TAMPER_STAMP_LXTAL_IRQHandler     [WEAK]
                EXPORT  RTC_WKUP_IRQHandler               [WEAK]
                EXPORT  NVMC_IRQHandler                   [WEAK]
                EXPORT  RCU_IRQHandler                    [WEAK]
                EXPORT  EXTI0_IRQHandler                  [WEAK]
                EXPORT  EXTI1_IRQHandler                  [WEAK]
                EXPORT  EXTI2_IRQHandler                  [WEAK]
                EXPORT  EXTI3_IRQHandler                  [WEAK]
                EXPORT  EXTI4_IRQHandler                  [WEAK]
                EXPORT  DMA0_Channel0_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel1_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel2_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel3_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel4_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel5_IRQHandler          [WEAK]
                EXPORT  DMA0_Channel6_IRQHandler          [WEAK]
                EXPORT  ADC0_1_RDCM_IRQHandler            [WEAK]
                EXPORT  EXTI5_9_IRQHandler                [WEAK]
                EXPORT  TIMER0_BRK_IRQHandler             [WEAK]
                EXPORT  TIMER0_UP_IRQHandler              [WEAK]
                EXPORT  TIMER0_TRG_CMT_IRQHandler         [WEAK]
                EXPORT  TIMER0_Channel_IRQHandler         [WEAK]
                EXPORT  TIMER1_IRQHandler                 [WEAK]
                EXPORT  TIMER2_IRQHandler                 [WEAK]
                EXPORT  TIMER3_IRQHandler                 [WEAK]
                EXPORT  I2C0_EV_IRQHandler                [WEAK]
                EXPORT  I2C0_ER_IRQHandler                [WEAK]
                EXPORT  I2C1_EV_IRQHandler                [WEAK]
                EXPORT  I2C1_ER_IRQHandler                [WEAK]
                EXPORT  SPI0_IRQHandler                   [WEAK]
                EXPORT  SPI1_IRQHandler                   [WEAK]
                EXPORT  USART0_IRQHandler                 [WEAK]
                EXPORT  USART1_IRQHandler                 [WEAK]
                EXPORT  USART2_IRQHandler                 [WEAK]
                EXPORT  EXTI10_15_IRQHandler              [WEAK]
                EXPORT  RTC_Alarm_IRQHandler              [WEAK]
                EXPORT  TIMER7_BRK_IRQHandler             [WEAK]
                EXPORT  TIMER7_UP_IRQHandler              [WEAK]
                EXPORT  TIMER7_TRG_CMT_IRQHandler         [WEAK]
                EXPORT  TIMER7_Channel_IRQHandler         [WEAK]
                EXPORT  DMA0_Channel7_IRQHandler          [WEAK]
                EXPORT  EXMC_IRQHandler                   [WEAK]
                EXPORT  SDIO0_IRQHandler                  [WEAK]
                EXPORT  TIMER4_IRQHandler                 [WEAK]
                EXPORT  SPI2_IRQHandler                   [WEAK]
                EXPORT  UART3_IRQHandler                  [WEAK]
                EXPORT  UART4_IRQHandler                  [WEAK]
                EXPORT  TIMER5_DAC_UDR_IRQHandler         [WEAK]
                EXPORT  TIMER6_IRQHandler                 [WEAK]
                EXPORT  DMA1_Channel0_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel1_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel2_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel3_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel4_IRQHandler          [WEAK]
                EXPORT  ENET0_IRQHandler                  [WEAK]
                EXPORT  ENET0_WKUP_IRQHandler             [WEAK]
                EXPORT  DMA1_Channel5_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel6_IRQHandler          [WEAK]
                EXPORT  DMA1_Channel7_IRQHandler          [WEAK]
                EXPORT  USART5_IRQHandler                 [WEAK]
                EXPORT  I2C2_EV_IRQHandler                [WEAK]
                EXPORT  I2C2_ER_IRQHandler                [WEAK]
                EXPORT  USBHS0_EP1_OUT_IRQHandler         [WEAK]
                EXPORT  USBHS0_EP1_IN_IRQHandler          [WEAK]
                EXPORT  USBHS0_WKUP_IRQHandler            [WEAK]
                EXPORT  USBHS0_IRQHandler                 [WEAK]
                EXPORT  DCI_IRQHandler                    [WEAK]
                EXPORT  CAU_IRQHandler                    [WEAK]
                EXPORT  HAU_TRNG_IRQHandler               [WEAK]
                EXPORT  FPU_IRQHandler                    [WEAK]
                EXPORT  UART6_IRQHandler                  [WEAK]
                EXPORT  UART7_IRQHandler                  [WEAK]
                EXPORT  SPI3_IRQHandler                   [WEAK]
                EXPORT  SPI4_IRQHandler                   [WEAK]
                EXPORT  SPI5_IRQHandler                   [WEAK]
                EXPORT  SAI0_IRQHandler                   [WEAK]
                EXPORT  TLI_IRQHandler                    [WEAK]
                EXPORT  TLI_ER_IRQHandler                 [WEAK]
                EXPORT  IPA_IRQHandler                    [WEAK]
                EXPORT  SAI1_IRQHandler                   [WEAK]
                EXPORT  OSPI0_IRQHandler                  [WEAK]
                EXPORT  I2C3_EV_IRQHandler                [WEAK]
                EXPORT  I2C3_ER_IRQHandler                [WEAK]
                EXPORT  RSPDIF_IRQHandler                 [WEAK]
                EXPORT  DMAMUX_OVR_IRQHandler             [WEAK]
                EXPORT  HPDF_INT4_IRQHandler              [WEAK]
                EXPORT  HPDF_INT0_IRQHandler              [WEAK]
                EXPORT  HPDF_INT1_IRQHandler              [WEAK]
                EXPORT  HPDF_INT2_IRQHandler              [WEAK]
                EXPORT  HPDF_INT3_IRQHandler              [WEAK]
                EXPORT  SAI2_IRQHandler                   [WEAK]
                EXPORT  TIMER14_IRQHandler                [WEAK]
                EXPORT  TIMER15_IRQHandler                [WEAK]
                EXPORT  TIMER16_IRQHandler                [WEAK]
                EXPORT  MDIO_IRQHandler                   [WEAK]
                EXPORT  MDMA_IRQHandler                   [WEAK]
                EXPORT  SDIO1_IRQHandler                  [WEAK]
                EXPORT  HWSEM_IRQHandler                  [WEAK]
                EXPORT  ADC2_IRQHandler                   [WEAK]
                EXPORT  CMP0_1_IRQHandler                 [WEAK]
                EXPORT  CTC_IRQHandler                    [WEAK]
                EXPORT  RAMECCMU_IRQHandler               [WEAK]
                EXPORT  SAI3_IRQHandler                   [WEAK]
                EXPORT  OSPI1_IRQHandler                  [WEAK]
                EXPORT  RTDEC0_IRQHandler                 [WEAK]
                EXPORT  RTDEC1_IRQHandler                 [WEAK]
                EXPORT  FAC_IRQHandler                    [WEAK]
                EXPORT  TMU_IRQHandler                    [WEAK]
                EXPORT  FFT_IRQHandler                    [WEAK]
                EXPORT  ESC_SYNC0_IRQHandler              [WEAK]
                EXPORT  ESC_SYNC1_IRQHandler              [WEAK]
                EXPORT  ESC_IRQHandler                    [WEAK]
                EXPORT  TIMER22_IRQHandler                [WEAK]
                EXPORT  TIMER23_IRQHandler                [WEAK]
                EXPORT  TIMER30_IRQHandler                [WEAK]
                EXPORT  TIMER31_IRQHandler                [WEAK]
                EXPORT  TIMER40_IRQHandler                [WEAK]
                EXPORT  TIMER41_IRQHandler                [WEAK]
                EXPORT  TIMER42_IRQHandler                [WEAK]
                EXPORT  TIMER43_IRQHandler                [WEAK]
                EXPORT  TIMER44_IRQHandler                [WEAK]
                EXPORT  TIMER50_IRQHandler                [WEAK]
                EXPORT  TIMER51_IRQHandler                [WEAK]
                EXPORT  USBHS1_EP1_OUT_IRQHandler         [WEAK]
                EXPORT  USBHS1_EP1_IN_IRQHandler          [WEAK]
                EXPORT  USBHS1_WKUP_IRQHandler            [WEAK]
                EXPORT  USBHS1_IRQHandler                 [WEAK]
                EXPORT  ENET1_IRQHandler                  [WEAK]
                EXPORT  ENET1_WKUP_IRQHandler             [WEAK]
                EXPORT  CAN0_WKUP_IRQHandler              [WEAK]
                EXPORT  CAN0_Message_IRQHandler           [WEAK]
                EXPORT  CAN0_Busoff_IRQHandler            [WEAK]
                EXPORT  CAN0_Error_IRQHandler             [WEAK]
                EXPORT  CAN0_FastError_IRQHandler         [WEAK]
                EXPORT  CAN0_TEC_IRQHandler               [WEAK]
                EXPORT  CAN0_REC_IRQHandler               [WEAK]
                EXPORT  CAN1_WKUP_IRQHandler              [WEAK]
                EXPORT  CAN1_Message_IRQHandler           [WEAK]
                EXPORT  CAN1_Busoff_IRQHandler            [WEAK]
                EXPORT  CAN1_Error_IRQHandler             [WEAK]
                EXPORT  CAN1_FastError_IRQHandler         [WEAK]
                EXPORT  CAN1_TEC_IRQHandler               [WEAK]
                EXPORT  CAN1_REC_IRQHandler               [WEAK]
                EXPORT  CAN2_WKUP_IRQHandler              [WEAK]
                EXPORT  CAN2_Message_IRQHandler           [WEAK]
                EXPORT  CAN2_Busoff_IRQHandler            [WEAK]
                EXPORT  CAN2_Error_IRQHandler             [WEAK]
                EXPORT  CAN2_FastError_IRQHandler         [WEAK]
                EXPORT  CAN2_TEC_IRQHandler               [WEAK]
                EXPORT  CAN2_REC_IRQHandler               [WEAK]
                EXPORT  OTP_IRQHandler                    [WEAK]
                EXPORT  I2C0_WKUP_IRQHandler              [WEAK]
                EXPORT  I2C1_WKUP_IRQHandler              [WEAK]
                EXPORT  I2C2_WKUP_IRQHandler              [WEAK]
                EXPORT  I2C3_WKUP_IRQHandler              [WEAK]
                EXPORT  LPDTS_IRQHandler                  [WEAK]
                EXPORT  LPDTS_WKUP_IRQHandler             [WEAK]
                EXPORT  TIMER0_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER7_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER1_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER2_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER3_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER4_DEC_IRQHandler             [WEAK]
                EXPORT  TIMER22_DEC_IRQHandler            [WEAK]
                EXPORT  TIMER23_DEC_IRQHandler            [WEAK]
                EXPORT  TIMER30_DEC_IRQHandler            [WEAK]
                EXPORT  TIMER31_DEC_IRQHandler            [WEAK]
                EXPORT  CPU_DCACHE_ERR_IRQHandler         [WEAK]
                EXPORT  CPU_ICACHE_ERR_IRQHandler         [WEAK]
                EXPORT  VOVD_VUVD_FILTER_IRQHandler       [WEAK]
                EXPORT  TIMER0_Channel_BRK_IRQHandler     [WEAK]
                EXPORT  TIMER7_Channel_BRK_IRQHandler     [WEAK]
                EXPORT  DSI_IRQHandler                    [WEAK]
                EXPORT  PKCAU_IRQHandler                  [WEAK]
                EXPORT  ESC_BRIDGE_IRQHandler             [WEAK]
                EXPORT  EDIM_IRQHandler                   [WEAK]

;/* external interrupts handler */
WWDGT_IRQHandler                  
VAVD_LVD_VOVD_VUVD_IRQHandler     
TAMPER_STAMP_LXTAL_IRQHandler     
RTC_WKUP_IRQHandler               
NVMC_IRQHandler                   
RCU_IRQHandler                    
EXTI0_IRQHandler                  
EXTI1_IRQHandler                  
EXTI2_IRQHandler                  
EXTI3_IRQHandler                  
EXTI4_IRQHandler                  
DMA0_Channel0_IRQHandler          
DMA0_Channel1_IRQHandler          
DMA0_Channel2_IRQHandler          
DMA0_Channel3_IRQHandler          
DMA0_Channel4_IRQHandler          
DMA0_Channel5_IRQHandler          
DMA0_Channel6_IRQHandler          
ADC0_1_RDCM_IRQHandler            
EXTI5_9_IRQHandler                
TIMER0_BRK_IRQHandler             
TIMER0_UP_IRQHandler              
TIMER0_TRG_CMT_IRQHandler         
TIMER0_Channel_IRQHandler         
TIMER1_IRQHandler                 
TIMER2_IRQHandler                 
TIMER3_IRQHandler                 
I2C0_EV_IRQHandler                
I2C0_ER_IRQHandler                
I2C1_EV_IRQHandler                
I2C1_ER_IRQHandler                
SPI0_IRQHandler                   
SPI1_IRQHandler                   
USART0_IRQHandler                 
USART1_IRQHandler                 
USART2_IRQHandler                 
EXTI10_15_IRQHandler              
RTC_Alarm_IRQHandler              
TIMER7_BRK_IRQHandler             
TIMER7_UP_IRQHandler              
TIMER7_TRG_CMT_IRQHandler         
TIMER7_Channel_IRQHandler         
DMA0_Channel7_IRQHandler          
EXMC_IRQHandler                   
SDIO0_IRQHandler                  
TIMER4_IRQHandler                 
SPI2_IRQHandler                   
UART3_IRQHandler                  
UART4_IRQHandler                  
TIMER5_DAC_UDR_IRQHandler         
TIMER6_IRQHandler                 
DMA1_Channel0_IRQHandler          
DMA1_Channel1_IRQHandler          
DMA1_Channel2_IRQHandler          
DMA1_Channel3_IRQHandler          
DMA1_Channel4_IRQHandler          
ENET0_IRQHandler                  
ENET0_WKUP_IRQHandler             
DMA1_Channel5_IRQHandler          
DMA1_Channel6_IRQHandler          
DMA1_Channel7_IRQHandler          
USART5_IRQHandler                 
I2C2_EV_IRQHandler                
I2C2_ER_IRQHandler                
USBHS0_EP1_OUT_IRQHandler         
USBHS0_EP1_IN_IRQHandler          
USBHS0_WKUP_IRQHandler            
USBHS0_IRQHandler                 
DCI_IRQHandler                    
CAU_IRQHandler                    
HAU_TRNG_IRQHandler               
FPU_IRQHandler                    
UART6_IRQHandler                  
UART7_IRQHandler                  
SPI3_IRQHandler                   
SPI4_IRQHandler                   
SPI5_IRQHandler                   
SAI0_IRQHandler                   
TLI_IRQHandler                    
TLI_ER_IRQHandler                 
IPA_IRQHandler                    
SAI1_IRQHandler                   
OSPI0_IRQHandler                  
I2C3_EV_IRQHandler                
I2C3_ER_IRQHandler                
RSPDIF_IRQHandler                 
DMAMUX_OVR_IRQHandler             
HPDF_INT4_IRQHandler              
HPDF_INT0_IRQHandler              
HPDF_INT1_IRQHandler              
HPDF_INT2_IRQHandler              
HPDF_INT3_IRQHandler              
SAI2_IRQHandler                   
TIMER14_IRQHandler                
TIMER15_IRQHandler                
TIMER16_IRQHandler                
MDIO_IRQHandler                   
MDMA_IRQHandler                   
SDIO1_IRQHandler                  
HWSEM_IRQHandler                  
ADC2_IRQHandler                   
CMP0_1_IRQHandler                 
CTC_IRQHandler                    
RAMECCMU_IRQHandler               
SAI3_IRQHandler                   
OSPI1_IRQHandler                  
RTDEC0_IRQHandler                 
RTDEC1_IRQHandler                 
FAC_IRQHandler                    
TMU_IRQHandler                    
FFT_IRQHandler                    
ESC_SYNC0_IRQHandler              
ESC_SYNC1_IRQHandler              
ESC_IRQHandler                    
TIMER22_IRQHandler                
TIMER23_IRQHandler                
TIMER30_IRQHandler                
TIMER31_IRQHandler                
TIMER40_IRQHandler                
TIMER41_IRQHandler                
TIMER42_IRQHandler                
TIMER43_IRQHandler                
TIMER44_IRQHandler                
TIMER50_IRQHandler                
TIMER51_IRQHandler                
USBHS1_EP1_OUT_IRQHandler         
USBHS1_EP1_IN_IRQHandler          
USBHS1_WKUP_IRQHandler            
USBHS1_IRQHandler                 
ENET1_IRQHandler                  
ENET1_WKUP_IRQHandler             
CAN0_WKUP_IRQHandler              
CAN0_Message_IRQHandler           
CAN0_Busoff_IRQHandler            
CAN0_Error_IRQHandler             
CAN0_FastError_IRQHandler         
CAN0_TEC_IRQHandler               
CAN0_REC_IRQHandler               
CAN1_WKUP_IRQHandler              
CAN1_Message_IRQHandler           
CAN1_Busoff_IRQHandler            
CAN1_Error_IRQHandler             
CAN1_FastError_IRQHandler         
CAN1_TEC_IRQHandler               
CAN1_REC_IRQHandler               
CAN2_WKUP_IRQHandler              
CAN2_Message_IRQHandler           
CAN2_Busoff_IRQHandler            
CAN2_Error_IRQHandler             
CAN2_FastError_IRQHandler         
CAN2_TEC_IRQHandler               
CAN2_REC_IRQHandler               
OTP_IRQHandler                    
I2C0_WKUP_IRQHandler              
I2C1_WKUP_IRQHandler              
I2C2_WKUP_IRQHandler              
I2C3_WKUP_IRQHandler              
LPDTS_IRQHandler                  
LPDTS_WKUP_IRQHandler             
TIMER0_DEC_IRQHandler             
TIMER7_DEC_IRQHandler             
TIMER1_DEC_IRQHandler             
TIMER2_DEC_IRQHandler             
TIMER3_DEC_IRQHandler             
TIMER4_DEC_IRQHandler             
TIMER22_DEC_IRQHandler            
TIMER23_DEC_IRQHandler            
TIMER30_DEC_IRQHandler            
TIMER31_DEC_IRQHandler            
CPU_DCACHE_ERR_IRQHandler         
CPU_ICACHE_ERR_IRQHandler         
VOVD_VUVD_FILTER_IRQHandler       
TIMER0_Channel_BRK_IRQHandler     
TIMER7_Channel_BRK_IRQHandler     
DSI_IRQHandler                    
PKCAU_IRQHandler                  
ESC_BRIDGE_IRQHandler             
EDIM_IRQHandler                   


                B       .

                ENDP

                ALIGN

; user Initial Stack & Heap

                 IF      :DEF:__MICROLIB
                
                 EXPORT  __initial_sp
                 EXPORT  __heap_base
                 EXPORT  __heap_limit
                
                 ELSE
                
                 IMPORT  __use_two_region_memory
                 EXPORT  __user_initial_stackheap
                 
__user_initial_stackheap

                 LDR     R0, =  Heap_Mem
                 LDR     R1, =(Stack_Mem + Stack_Size)
                 LDR     R2, = (Heap_Mem +  Heap_Size)
                 LDR     R3, = Stack_Mem
                 BX      LR

                 ALIGN

                 ENDIF

                 END

